NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
    return NULL;
}

static uint32_t config_packet_send(proxy_connection_t * p_connection,
                                   const nrf_mesh_network_secmat_t * p_secmat,
                                   uint32_t msg_len)
{
    uint16_t src_addr_count;
    network_packet_metadata_t tx_net_meta = {
        .dst = {
            .type = NRF_MESH_ADDRESS_TYPE_INVALID,
            .value = 0
        },
        .ttl = 0,
        .control_packet = true,
        .internal = {
            .iv_index = net_state_tx_iv_index_get()
        }, /*lint !e446 side effect in initializer */
        .p_security_material = p_secmat
    };

    nrf_mesh_unicast_address_get(&tx_net_meta.src, &src_addr_count);

    if (net_state_seqnum_alloc(&tx_net_meta.internal.sequence_number) != NRF_SUCCESS)
    {
        packet_discard(p_connection);
        return NRF_ERROR_BUSY;
    }

    net_packet_header_set((packet_mesh_net_packet_t *) p_connection->p_alloc_packet, &tx_net_meta);

    net_packet_encrypt(&tx_net_meta,
                       msg_len,
                       (packet_mesh_net_packet_t *) p_connection->p_alloc_packet,
                       NET_PACKET_KIND_PROXY_CONFIG);

    packet_send(p_connection);
    return NRF_SUCCESS;
}

static uint32_t filter_status_send(proxy_connection_t * p_connection,
                                   const nrf_mesh_network_secmat_t * p_secmat)
{
    uint32_t filter_status_len =
        PROXY_CONFIG_PARAM_OVERHEAD + sizeof(proxy_config_params_filter_status_t);

    proxy_config_msg_t * p_status = config_packet_alloc(p_connection, filter_status_len);
    if (p_status)
    {
        p_status->opcode                           = PROXY_CONFIG_OPCODE_FILTER_STATUS;
        p_status->params.filter_status.filter_type = p_connection->filter.type;
        p_status->params.filter_status.list_size   = LE2BE16(p_connection->filter.count);

        return config_packet_send(p_connection, p_secmat, filter_status_len);
    }
    return NRF_ERROR_NO_MEM;
}

static uint32_t config_packet_in_filter_type_set(proxy_connection_t * p_connection,
                                                 const proxy_config_params_filter_type_set_t * p_params,
                                                 uint32_t params_len)
{
    if (params_len == sizeof(proxy_config_params_filter_type_set_t))
    {
        return proxy_filter_type_set(&p_connection->filter,
                                     (proxy_filter_type_t) p_params->filter_type);
    }
    else
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
}

static uint32_t config_packet_in_filter_addr_add(proxy_connection_t * p_connection,
                                                 proxy_config_params_filter_addr_add_t * p_params,
                                                 uint32_t params_len)
{
    if (params_len <= sizeof(proxy_config_params_filter_addr_add_t) && !(params_len & 0x01))
    {
        /* Move addresses to array on stack. The array is defined with max size to avoid ARMCC
         * secretly adding it to heap:
         * http://infocenter.arm.com/help/topic/com.arm.doc.dui0472m/chr1359124223721.html
         */
        uint16_t addrs[MESH_GATT_PROXY_FILTER_ADDR_COUNT];
        uint32_t addr_count = params_len / sizeof(uint16_t);
        ADDRS_LIST_ENDIANESS_SWAP_AND_COPY(addrs, p_params->addrs, addr_count);
        proxy_filter_add(&p_connection->filter, addrs, addr_count);
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
}

static uint32_t config_packet_in_filter_addr_remove(proxy_connection_t * p_connection,
                                                 proxy_config_params_filter_addr_remove_t * p_params,
                                                 uint32_t params_len)
{
    if (params_len <= sizeof(proxy_config_params_filter_addr_remove_t) && !(params_len & 0x01))
    {
        /* Move addresses to array on stack. The array is defined with max size to avoid ARMCC
         * secretly adding it to heap:
         * http://infocenter.arm.com/help/topic/com.arm.doc.dui0472m/chr1359124223721.html
         */
        uint16_t addrs[MESH_GATT_PROXY_FILTER_ADDR_COUNT];
        uint32_t addr_count = params_len / sizeof(uint16_t);
        ADDRS_LIST_ENDIANESS_SWAP_AND_COPY(addrs, p_params->addrs, addr_count);
        proxy_filter_remove(&p_connection->filter, addrs, addr_count);
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
}

static void config_packet_in(proxy_connection_t * p_connection,
                                 const uint8_t * p_data,
                                 uint32_t length)
{
    if (length <= MESH_GATT_PROXY_PDU_MAX_SIZE && length >= PROXY_CONFIG_PARAM_OVERHEAD)
    {
        network_packet_metadata_t net_meta;
        uint8_t decrypted_packet[MESH_GATT_PROXY_PDU_MAX_SIZE];

        if (config_packet_decrypt(&net_meta, p_data, length, decrypted_packet))
        {
            proxy_config_msg_t * p_msg = (proxy_config_msg_t *) net_packet_payload_get(
                (packet_mesh_net_packet_t *) decrypted_packet);

            uint32_t params_len =
                (net_packet_payload_len_get(&net_meta, length) - PROXY_CONFIG_PARAM_OVERHEAD);

            uint32_t status;
            switch (p_msg->opcode)
            {
                case PROXY_CONFIG_OPCODE_FILTER_TYPE_SET:
                    status = config_packet_in_filter_type_set(p_connection,
                                                              &p_msg->params.filter_type_set,
                                                              params_len);
                    break;
                case PROXY_CONFIG_OPCODE_FILTER_ADDR_ADD:
                    status = config_packet_in_filter_addr_add(p_connection,
                                                              &p_msg->params.filter_addr_add,
                                                              params_len);
                    break;
                case PROXY_CONFIG_OPCODE_FILTER_ADDR_REMOVE:
                    status = config_packet_in_filter_addr_remove(p_connection,
                                                                 &p_msg->params.filter_addr_remove,
                                                                 params_len);
                    break;
                default:
                    status = NRF_ERROR_NOT_FOUND;
            }

            if (status == NRF_SUCCESS)
            {
                (void) filter_status_send(p_connection,
                                          net_meta.p_security_material);
            }
        }
        else
        {
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "Decryption failed\n");
        }
    }
    else
    {
        __LOG(LOG_SRC_BEARER, LOG_LEVEL_WARN, "Config packet too long (%u bytes), dropped it\n", length);
    }
}

