NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
static void rx_handle(proxy_connection_t * p_connection,
                      mesh_gatt_pdu_type_t pdu_type,
                      const uint8_t * p_data,
                      uint32_t length)
{
    const nrf_mesh_rx_metadata_t rx_metadata = {
        .source = NRF_MESH_RX_SOURCE_GATT,
        .params.gatt = {
            .timestamp = timer_now(), /*lint !e446 side effect in initializer */
            .connection_index = connection_index(p_connection) /*lint !e446 side effect in initializer */
        }
    };

    __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "RX GATT PDU type 0x%x, len %u\n", pdu_type, length);

    switch (pdu_type)
    {
        case MESH_GATT_PDU_TYPE_NETWORK_PDU:
            (void) network_packet_in(p_data, length, &rx_metadata);
            break;
        case MESH_GATT_PDU_TYPE_MESH_BEACON:
            net_beacon_packet_in(p_data, length, &rx_metadata);
            break;
        case MESH_GATT_PDU_TYPE_PROXY_CONFIG:
            config_packet_in(p_connection, p_data, length);
            break;
        default:
            /* Ignore unknown PDU type, according to Mesh Profile Specification v1.0, section 6.6 */
            break;
    }
}

static void gatt_evt_handler(const mesh_gatt_evt_t * p_evt, void * p_context)
{
    proxy_connection_t * p_connection = &m_connections[p_evt->conn_index];

    switch (p_evt->type)
    {
        case MESH_GATT_EVT_TYPE_CONNECTED:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "Connected\n");
            on_adv_end();
            p_connection->connected = true;
            connection_reset(p_connection);

            /* Send beacons for all known networks upon connection */
            beacon_cycle_trigger(p_connection);

            /* Advertising must be restarted manually after connecting: */
            if (active_connection_count() < MESH_GATT_CONNECTION_COUNT_MAX)
            {
                adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
            }
            break;

        case MESH_GATT_EVT_TYPE_DISCONNECTED:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "Disconnected\n");

            p_connection->connected = false;
            if (m_enabled && !m_advertising.running)
            {
                adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
            }
            break;

        case MESH_GATT_EVT_TYPE_TX_READY:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "TX ready\n");
            beacon_cycle_send(p_connection);
            break;

        case MESH_GATT_EVT_TYPE_RX:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "RX\n");
            rx_handle(p_connection,
                      p_evt->params.rx.pdu_type,
                      p_evt->params.rx.p_data,
                      p_evt->params.rx.length);
            break;

        case MESH_GATT_EVT_TYPE_TX_COMPLETE:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "TX complete\n");
            if (p_evt->params.tx_complete.pdu_type == MESH_GATT_PDU_TYPE_NETWORK_PDU)
            {
                core_tx_role_t role = (p_evt->params.tx_complete.token == NRF_MESH_RELAY_TOKEN)
                                          ? CORE_TX_ROLE_RELAY
                                          : CORE_TX_ROLE_ORIGINATOR;

                core_tx_complete(&p_connection->bearer,
                                 role,
                                 timer_now(),
                                 p_evt->params.tx_complete.token);
            }
            break;

        case MESH_GATT_EVT_TYPE_ADV_TIMEOUT:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "Adv timeout\n");
            /* The node identity state timed out, go back to network ID advertisements */
            m_advertising.running = false;
            if (m_enabled)
            {
                adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
            }
            break;

        default:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_WARN, "Got an unknown GATT evt 0x%x\n", p_evt->type);
    }
}

static void mesh_evt_handle(const nrf_mesh_evt_t * p_evt)
{
    /* According to Section 6.6 in the Mesh Profile Specification v1.0, we should forward all
     * beacons with new values for IV index or flags. We'll maintain a small cache of previous beacons
     * to enforce this by best effort.
     */
    if (p_evt->type == NRF_MESH_EVT_NET_BEACON_RECEIVED)
    {
        if (p_evt->params.net_beacon.p_rx_metadata->source != NRF_MESH_RX_SOURCE_GATT &&
            !cache_has_elem(&m_beacon_cache, p_evt->params.net_beacon.p_auth_value))
        {
            if (beacon_packet_send_to_all(p_evt->params.net_beacon.p_beacon_secmat,
                                            p_evt->params.net_beacon.iv_index,
                                            p_evt->params.net_beacon.flags.iv_update,
                                            p_evt->params.net_beacon.flags.key_refresh) == NRF_SUCCESS)
            {
                cache_put(&m_beacon_cache, p_evt->params.net_beacon.p_auth_value);
            }
        }
    }
}

static void adv_net_iterate(void)
{
    nrf_mesh_key_refresh_phase_t kr_phase;
    nrf_mesh_beacon_info_next_get(NULL, &m_advertising.p_net_beacon_info, &kr_phase);
    if (m_advertising.p_net_beacon_info == NULL)
    {
        /* Start from the beginning when we reach the end */
        nrf_mesh_beacon_info_next_get(NULL, &m_advertising.p_net_beacon_info, &kr_phase);
        NRF_MESH_ASSERT(m_advertising.p_net_beacon_info);
    }
}

static void adv_data_set(void)
{
    const nrf_mesh_beacon_secmat_t * p_secmat =
        nrf_mesh_beacon_secmat_from_info(m_advertising.p_net_beacon_info, m_advertising.kr_phase);
    if (m_advertising.type == PROXY_ADV_TYPE_NETWORK_ID)
    {
        adv_data_network_id_set(p_secmat->net_id);
    }
    else if (m_advertising.type == PROXY_ADV_TYPE_NODE_ID)
    {
        uint16_t src_addr;
        uint16_t addr_count;
        nrf_mesh_unicast_address_get(&src_addr, &addr_count);

        adv_data_node_id_set(p_secmat->identity_key, src_addr);
    }
}

static void adv_timer_handler(uint32_t timeout, void * p_context)
{
    adv_net_iterate();
    adv_data_set();
}

static void adv_start(proxy_adv_type_t proxy_adv_type, bool interleave_networks)
{
    uint32_t timeout = ((proxy_adv_type == PROXY_ADV_TYPE_NETWORK_ID) ? ADV_NETWORK_ID_TIMEOUT_MS
                                                                      : ADV_NODE_ID_TIMEOUT_MS);
    m_advertising.type = proxy_adv_type;

