NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
    if (m_advertising.running)
    {
        mesh_adv_stop();
    }

    if (interleave_networks)
    {
        adv_net_iterate();
        timer_sch_reschedule(&m_advertising.timer, timer_now() + m_advertising.timer.interval);
    }
    else
    {
        timer_sch_abort(&m_advertising.timer);
    }

    mesh_adv_params_set(timeout, (MESH_GATT_PROXY_ADV_INT_MS * 1000) / 625);
    adv_data_set();
    mesh_adv_start();
    m_advertising.running = true;
}

/*****************************************************************************
* Core TX callback functions
*****************************************************************************/
core_tx_alloc_result_t core_tx_packet_alloc_cb(core_tx_bearer_t * p_bearer,
                                               const core_tx_alloc_params_t * p_params)
{
    NRF_MESH_ASSERT(p_bearer && p_params);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);

    if (p_connection->connected && proxy_filter_accept(&p_connection->filter, p_params->p_metadata->dst.value))
    {
        uint32_t status = packet_alloc(p_connection, MESH_GATT_PDU_TYPE_NETWORK_PDU, p_params->net_packet_len, p_params->token);

        return ((status == NRF_SUCCESS) ? CORE_TX_ALLOC_SUCCESS : CORE_TX_ALLOC_FAIL_NO_MEM);
    }
    else
    {
        return CORE_TX_ALLOC_FAIL_REJECTED;
    }
}

void core_tx_packet_send_cb(core_tx_bearer_t * p_bearer, const uint8_t * p_packet, uint32_t packet_length)
{
    NRF_MESH_ASSERT(p_bearer && p_packet);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);
    NRF_MESH_ASSERT(p_connection->p_alloc_packet);

    memcpy(p_connection->p_alloc_packet, p_packet, packet_length);
    packet_send(p_connection);
}

void core_tx_packet_discard_cb(core_tx_bearer_t * p_bearer)
{
    NRF_MESH_ASSERT(p_bearer);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);
    packet_discard(p_connection);
}
/*****************************************************************************
* Interface functions
*****************************************************************************/
void proxy_init(void)
{
    m_enabled = false;
    mesh_gatt_uuids_t uuids = {.service = PROXY_UUID_SERVICE,
                               .tx_char = PROXY_UUID_CHAR_TX,
                               .rx_char = PROXY_UUID_CHAR_RX};
    mesh_gatt_init(&uuids, gatt_evt_handler, NULL);
    m_mesh_evt_handler.evt_cb = mesh_evt_handle;
    nrf_mesh_evt_handler_add(&m_mesh_evt_handler);

    m_beacon_cache.array_len = MESH_GATT_PROXY_BEACON_CACHE_SIZE;
    m_beacon_cache.elem_array = m_beacon_cache_entries;
    m_beacon_cache.elem_size = sizeof(sizeof(beacon_cache_entry_t));
    cache_init(&m_beacon_cache);

    m_advertising.timer.cb = adv_timer_handler;
    m_advertising.timer.interval = ADV_NETWORK_ITERATE_INTERVAL_US;
    m_advertising.running        = false;
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        core_tx_bearer_add(&m_connections[i].bearer, &m_interface, CORE_TX_BEARER_TYPE_GATT_SERVER);
        m_connections[i].connected = false;
    }
}

void proxy_subnet_added(uint16_t net_key_index, const uint8_t * p_network_id)
{
    NRF_MESH_ASSERT(p_network_id);
    const nrf_mesh_beacon_info_t * p_beacon_info = NULL;
    nrf_mesh_key_refresh_phase_t kr_phase;
    nrf_mesh_beacon_info_next_get(p_network_id, &p_beacon_info, &kr_phase);
    NRF_MESH_ASSERT(p_beacon_info);

    (void) beacon_packet_send_to_all(nrf_mesh_beacon_secmat_from_info(p_beacon_info, kr_phase),
                                     net_state_beacon_iv_index_get(),
                                     net_state_iv_update_get(),
                                     net_beacon_key_refresh_flag(kr_phase));
}

void proxy_net_packet_processed(const network_packet_metadata_t * p_net_metadata, const nrf_mesh_rx_metadata_t * p_rx_meta)
{
    if (p_rx_meta->source == NRF_MESH_RX_SOURCE_GATT)
    {
        proxy_connection_t * p_connection = &m_connections[p_rx_meta->params.gatt.connection_index];

        if (p_connection->connected)
        {
            if (p_connection->filter.type == PROXY_FILTER_TYPE_WHITELIST)
            {
                proxy_filter_add(&p_connection->filter, &p_net_metadata->src, 1);
            }
            else
            {
                proxy_filter_remove(&p_connection->filter, &p_net_metadata->src, 1);
            }
        }
    }
}

uint32_t proxy_enable(void)
{
    if (m_enabled)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    else
    {
        m_advertising.p_net_beacon_info = NULL;
        m_enabled                       = true;
        adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
        return NRF_SUCCESS;
    }
}

uint32_t proxy_node_id_enable(const nrf_mesh_beacon_info_t * p_beacon_info, nrf_mesh_key_refresh_phase_t kr_phase)
{
    m_advertising.p_net_beacon_info = p_beacon_info;
    m_advertising.kr_phase          = kr_phase;
    m_enabled                       = true;
    if (active_connection_count() < MESH_GATT_CONNECTION_COUNT_MAX)
    {
        adv_start(PROXY_ADV_TYPE_NODE_ID, (p_beacon_info == NULL));
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_BUSY;
    }
}

bool proxy_node_id_is_enabled(const nrf_mesh_beacon_info_t * p_beacon_info)
{
    return (m_enabled &&
            m_advertising.running &&
            m_advertising.type == PROXY_ADV_TYPE_NODE_ID &&
            (p_beacon_info == NULL || p_beacon_info == m_advertising.p_net_beacon_info));
}

uint32_t proxy_node_id_disable(void)
{
    if (proxy_node_id_is_enabled(NULL))
    {
        adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_STATE;
    }
}

void proxy_disable(void)
{
    if (m_enabled)
    {
        m_enabled = false;
        if (m_advertising.running)
        {
            mesh_adv_stop();
            on_adv_end();
        }

        for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
        {
            if (m_connections[i].connected)
            {
                (void) mesh_gatt_disconnect(i);
                m_connections[i].connected = false;
            }
        }
    }
}

bool proxy_is_enabled(void)
{
    return m_enabled;
}

bool proxy_is_connected(void)
{
    return (m_enabled && active_connection_count() > 0);
}
